/*                       REXX                                        */
/*
   DESCRIPTION   :  UTILITY REXX TO GENERATE THE RUNSTATS STATEMENTS
   USAGE         :  TSO EX 'TSO.BNEELKA.EXEC(RUNSTAT)'
   INPUTS        :  A MEMBER OF ANY PDS. THIS MEMBER SHOULD CONTAIN
                    DATABASE NAME, TABLESPACE NAME.
   OUTPUT        :  DATASET NAME IN WHICH THE JCL HAS TO BE CREATED.
*/
ADDRESS ISPEXEC "CONTROL ERRORS RETURN"
SAY "ENTER THE DATASET NAME WHICH CONTAINS THE MEMBER"
O = MSG("OFF")
PULL PDSNAME
PDSNAME = WORD(PDSNAME,1)

SAY "ENTER THE MEMBER NAME WHICH CONTAINS THE GDG NAMES"
PULL MEMNAME
MEMNAME = WORD(MEMNAME,1)

DSNAME = "'"||PDSNAME|| "(" || MEMNAME || ")'"
"ALLOC F(IN) DA("||DSNAME||") REUSE SHR"
IF (RC > 0) THEN DO
   SAY "INCORRECT JCL MEMBER"
   EXIT 1
END
"EXECIO * DISKR IN (STEM TBLS. FINIS)"
"FREE F(IN)"

SAY "ENTER THE CATALOGED PDS NAME WHERE THEE JCL HAS TO BE CREATED"
PULL JCLLIB
JCLLIB = WORD(JCLLIB,1)

SAY "ENTER THE MEMBER NAME OF THE JCL"
PULL JCLMEM
JCLMEM = WORD(JCLMEM,1)

USER = USERID()
N = 1

DO I = 1 TO TBLS.0
   TBLS.I = TRANSLATE(TBLS.I,' ',',')
   DBNAME = WORD(TBLS.I,1)
   TSNAME = WORD(TBLS.I,2)
   ST.N = "RUNSTATS TABLESPACE "DBNAME"."TSNAME" TABLE ALL INDEX ALL"
   N = N + 1
   ST.N = "         SHRLEVEL REFERENCE UPDATE ALL"
   N = N + 1
END
ST.0 = N

"FREE F(OUT)"
JCLDSN = "'" || JCLLIB || "(" || JCLMEM || ")'"
"ALLOC DA("||JCLDSN||") F(OUT) SHR REUSE"
IF RC\=0 THEN DO
   SAY "DATASET ALLOCATION FAILED"
   EXIT
END
"EXECIO * DISKW OUT (STEM ST. FINIS)"
IF RC \= 0 THEN DO
   SAY "NOT ABLE TO WRITE " OUTDSN
   "FREE F(OUT)"
   EXIT 1
END
"FREE F(OUT)"
DROP ST.
EXIT
